module.exports = {
    _LANGUAGE: {
        NAME: "हिन्दी",
        CODE: "hi",
        FLAG: "🇮🇳"
    },
    COMMON: {
        YES: "हाँ",
        NO: "नहीं",
        OK: "ठीक है",
        CANCEL: "रद्द करें",
        SUBMIT: "जमा करें",
        DELETE: "हटाएं",
        EDIT: "संपादित करें",
        SAVE: "सहेजें",
        CLOSE: "बंद करें",
        NAME: "नाम",
        AUTHOR: "लेखक",
        USE: "उपयोग करें",
        NOT_IMPLEMENTED_YET: "अभी तक नहीं बना",
        ADMIN: "एडमिन",
        REDIRECTING: "पुनर्निर्देशित कर रहे हैं...",
        LOADING: "लोड हो रहा है...",
        NO_PERMISSION: "आपको इसकी अनुमति नहीं है",
        NOT_SELECTED: "चयनित नहीं",
        USER: "उपयोगकर्ता",
        SERVER: "सर्वर",
        HISTORY: "इतिहास",
        PREMIUM: "प्रीमियम",
        LOADING: "लोड हो रहा है...",
        TRY_AGAIN: "पुनः प्रयास करें",
        RELOAD: "पुनः लोड करें",
        RELOAD_PAGE: "पेज पुनः लोड करें",
        BACK: "वापस"
    },
    COMPONENTS: {
        BUILD_SWITCHER: {
            ERROR_FETCH_BUILDS: "बिल्ड प्राप्त करने में त्रुटि",
            UNKNOWN_ERROR: "अज्ञात त्रुटि",
            INVALID_BUILD_MESSAGE: "आप एक अमान्य बिल्ड का उपयोग कर रहे हैं। मुख्य बिल्ड पर वापस जा रहे हैं...",
            BUILD_NOT_FOUND: "बिल्ड नहीं मिला",
            ERROR_SWITCH_BUILD: "बिल्ड बदलने में त्रुटि",
            ERROR_FETCH_BRANCH: "वर्तमान ब्रांच प्राप्त करने में त्रुटि",
            BUILD_OVERRIDE: "बिल्ड ओवरराइड",
            CUSTOM_BRANCH_WARNING: "आप एक कस्टम ब्रांच संपादित कर रहे हैं",
            ACTIVE_BUILD: "सक्रिय बिल्ड",
            ACTIVE_BRANCH: "सक्रिय ब्रांच",
            SWITCHING_BUILD: "बिल्ड बदल रहे हैं..."
        },
        HEADER: {
            ADVANTAGES: "लाभ",
            PROFILE: "प्रोफाइल",
            DISCONNECT: "डिस्कनेक्ट करें",
            REMOVE_BUILD_OVERRIDE: "बिल्ड ओवरराइड हटाएं",
            LOGIN: "लॉगिन करें",
            LOGGED_OUT: "लॉग आउट",
            VIEW_AS_USER: "उपयोगकर्ता के रूप में देखें",
            NORMAL_VIEW: "सामान्य दृश्य"
        },
        PREMIUM_POPUP: {
            TITLE: "आपको प्रीमियम होना चाहिए!",
            DESCRIPTION1: "कल्पना करें कि आप ब्रह्मांड के किसी भी रंग को चुनकर पेंट कर सकते हैं... आप कर सकते हैं!",
            DESCRIPTION2: "PixelsPlace प्रीमियम के साथ यह और बहुत कुछ पाएं",
            MAYBE_LATER: "शायद बाद में",
            DISCOVER_PREMIUM: "प्रीमियम जानें!"
        },
        PREMIUM_WARNING: {
            FEATURE_PREMIUM_ONLY: "यह सुविधा केवल प्रीमियम के लिए है",
            BUY_PREMIUM_HERE: "यहाँ प्रीमियम खरीदें!"
        }
    },
    LAYOUTS: {
        MAIN_LAYOUT: {
            BANNED_TITLE: "आपको प्रतिबंधित कर दिया गया है।",
            AFFECTED_AREAS: "प्रभावित क्षेत्र",
            NO_FANCY_UNBAN_PAGE: "अनबैन फॉर्म के लिए कोई फैंसी पेज नहीं होगा, बस यही है अब",
            OPEN_TICKET_INSTRUCTION: "आप केवल एक टिकट खोल सकते हैं",
            EXPLAIN_WHAT_HAPPENED: "और समझाने की कोशिश करें कि क्या हुआ",
            MODS_HAVE_RECORDS: "लेकिन जान लें कि मॉड्स के पास सब कुछ का रिकॉर्ड है, इसलिए वे मूल रूप से सर्वज्ञ हैं... यदि आप कुछ चाहते हैं तो आपको वास्तव में एक अच्छा बहाना बनाना होगा",
            FAREWELL_MESSAGE: "खैर, बस यही है दोस्त",
            INVALID_BUILD_ALERT: "आप एक अमान्य बिल्ड का उपयोग कर रहे हैं, मुख्य बिल्ड पर वापस जा रहे हैं।"
        }
    },
    PAGES: {
        HOME: {
            META_DESCRIPTION: "PixelsPlace में भाग लें!",
            LOGO_ALT: "लोगो",
            TIME_TRAVEL: "टाइम ट्रैवल",
            SERVERS: "सर्वर",
            START: "शुरू करें",
        },
        DISCORD_OAUTH2: {
            LOGGED_IN: "लॉग इन",
            DISCONNECTED: "डिस्कनेक्ट",
            SUCCESS_REDIRECTING: "सफलतापूर्वक। पुनर्निर्देशित कर रहे हैं..."
        },
        BUILD_OVERRIDE: {
            LOADING_BUILD: "बिल्ड लोड हो रहा है...",
            REMOVING_BUILDS: "बिल्ड हटा रहे हैं...",
            INVALID_BUILD: "अमान्य बिल्ड",
            ERROR_FETCHING_BUILD: "बिल्ड प्राप्त करने में त्रुटि",
            TITLE: "क्या आप PixelsPlace में एक कस्टम बिल्ड का उपयोग करना चाहते हैं?",
            SIGNED_BY: "द्वारा हस्ताक्षरित",
            UPDATING_BUILD: "बिल्ड अपडेट कर रहे हैं...",
            REMOVE_INSTRUCTION: "यदि आप बाद में हटाना चाहते हैं, तो बस अपनी प्रोफाइल सेटिंग्स पर क्लिक करें"
        },
        USER_PROFILE: {
            PROFILE_BACKGROUND_ALT: "प्रोफाइल बैकग्राउंड",
            USER_AVATAR_ALT: "उपयोगकर्ता अवतार",
            GUILD_ICON_ALT: "{{guildName}} का आइकन",
            JOIN_GUILD: "शामिल हों",
            PIXELS_PLACED: "{{displayName}} ने {{pixelQuantity}} पिक्सेल डाले",
            VIEW_PIXELS: "{{displayName}} के पिक्सेल देखें"
        },
        PARTNERS: {
            SERVERS: "सर्वर",
            PARTICIPATING_SERVERS: "भाग लेने वाले सर्वर",
            SECRET: "गुप्त...",
            GUILD_ICON_ALT: "{{guildName}} का आइकन",
            JOIN: "शामिल हों"
        },
        TIME_TRAVEL: {
            PAGE_TITLE: "टाइमट्रैवल PixelsPlace",
            PAGE_DESCRIPTION: "PixelsPlace में भाग लें!",
            API_ERROR: "मुख्य API से कनेक्ट करने में त्रुटि हुई",
            RELOAD_BUTTON: "पुनः लोड करें",
            FULL_HISTORY: "पूरा इतिहास",
            CHANGES_ONLY: "केवल परिवर्तन",
            MARCH_LABEL: "मार्च (m):",
            MULTIPLIER_LABEL: "गुणक:"
        },
        PLACE: {
            META_DESCRIPTION: "PixelsPlace में भाग लें!",
            COPY_LINK: "पिक्सेल के लिए लिंक कॉपी करें",
            LINK_GENERATED: "लिंक जेनरेट किया गया:",
            LINK_SUCCESSFULLY_COPIED: "लिंक क्लिपबोर्ड में कॉपी किया गया!",
            PICK_COLOR: "रंग चुनें",
            PICK_A_COLOR: "एक रंग चुनें",
            PREMIUM_ONLY_COLOR: "यह रंग केवल प्रीमियम के लिए उपलब्ध है! :(",
            PLACE_PIXEL: "पिक्सेल रखें",
            LOG_IN_TO_PLACE_PIXEL: "पिक्सेल रखने के लिए लॉगिन करें",
            PLACE: "रखें!",
            PREMIUM_ANY_COLOR: "अपना मनचाहा रंग चुनें",
            WEBSOCKET_KICKED: "WebSocket डिस्कनेक्ट: आपको कमरे से निकाल दिया गया",
            ERROR_MAIN_API_CONNECT: "मुख्य API से कनेक्ट करने में त्रुटि हुई",
            ERROR_FAILED_WEBSOCKET: "WebSocket कनेक्शन विफल",
            WEBSOCKET_SEARCH: "WebSocket खोज रहे हैं...",
        }
    },
}