module.exports = {
    _LANGUAGE: {
        NAME: "ქართული",
        CODE: "ka",
        FLAG: "🇬🇪"
    },
    COMMON: {
        YES: "კი",
        NO: "არა",
        OK: "კარგი",
        CANCEL: "გაუქმება",
        SUBMIT: "გაგზავნა",
        DELETE: "წაშლა",
        EDIT: "რედაქტირება",
        SAVE: "შენახვა",
        CLOSE: "დახურვა",
        NAME: "სახელი",
        AUTHOR: "ავტორი",
        USE: "გამოყენება",
        NOT_IMPLEMENTED_YET: "ჯერ არ არის შექმნილი",
        ADMIN: "ადმინი",
        REDIRECTING: "გადამისამართება...",
        LOADING: "ჩატვირთვა...",
        NO_PERMISSION: "თქვენ არ გაქვთ ამის უფლება",
        NOT_SELECTED: "არ არის არჩეული",
        USER: "მომხმარებელი",
        SERVER: "სერვერი",
        HISTORY: "ისტორია",
        PREMIUM: "პრემიუმი",
        TRY_AGAIN: "კიდევ სცადეთ",
        RELOAD: "განახლება",
        RELOAD_PAGE: "გვერდის განახლება",
        BACK: "უკან"
    },
    COMPONENTS: {
        BUILD_SWITCHER: {
            ERROR_FETCH_BUILDS: "ბილდების მიღების შეცდომა",
            UNKNOWN_ERROR: "უცნობი შეცდომა",
            INVALID_BUILD_MESSAGE: "თქვენ იყენებთ არასწორ ბილდს. ძირითად ბილდზე დაბრუნება...",
            BUILD_NOT_FOUND: "ბილდი ვერ მოიძებნა",
            ERROR_SWITCH_BUILD: "ბილდის შეცვლის შეცდომა",
            ERROR_FETCH_BRANCH: "მიმდინარე ფილიალის მიღების შეცდომა",
            BUILD_OVERRIDE: "ბილდის გადაფარვა",
            CUSTOM_BRANCH_WARNING: "თქვენ რედაქტირებთ მორგებულ ფილიალს",
            ACTIVE_BUILD: "აქტიური ბილდი",
            ACTIVE_BRANCH: "აქტიური ფილიალი",
            SWITCHING_BUILD: "ბილდის შეცვლა..."
        },
        HEADER: {
            ADVANTAGES: "უპირატესობები",
            PROFILE: "პროფილი",
            DISCONNECT: "გათიშვა",
            REMOVE_BUILD_OVERRIDE: "ბილდის გადაფარვის მოშორება",
            LOGIN: "შესვლა",
            LOGGED_OUT: "გამოსული",
            VIEW_AS_USER: "მომხმარებლის სახით ნახვა",
            NORMAL_VIEW: "ჩვეულებრივი ნახვა"
        },
        PREMIUM_POPUP: {
            TITLE: "თქვენ გჭირდებათ პრემიუმი!",
            DESCRIPTION1: "წარმოიდგინეთ, რომ შეგიძლიათ აირჩიოთ სამყაროს ყველა ფერი ნახატისთვის... შეგიძლიათ!",
            DESCRIPTION2: "მიიღეთ ეს და კიდევ ბევრი PixelsPlace პრემიუმით",
            MAYBE_LATER: "შესაძლოა მოგვიანებით",
            DISCOVER_PREMIUM: "გაიცანით პრემიუმი!"
        },
        PREMIUM_WARNING: {
            FEATURE_PREMIUM_ONLY: "ეს ფუნქცია მხოლოდ პრემიუმისთვისაა",
            BUY_PREMIUM_HERE: "იყიდეთ პრემიუმი აქ!"
        }
    },
    LAYOUTS: {
        MAIN_LAYOUT: {
            BANNED_TITLE: "თქვენ დაბლოკილი ხართ.",
            AFFECTED_AREAS: "დაზარალებული ადგილები",
            NO_FANCY_UNBAN_PAGE: "ბლოკის მოხსნის ლამაზი გვერდი არ იქნება, ძირითადად ეს არის ყველაფერი რაც არის ახლა",
            OPEN_TICKET_INSTRUCTION: "ერთადერთი რაც შეგიძლიათ არის ტიკეტის გახსნა",
            EXPLAIN_WHAT_HAPPENED: "და სცადეთ ახსენით რა მოხდა",
            MODS_HAVE_RECORDS: "მაგრამ იცოდეთ, რომ მოდერატორებს აქვთ ყველაფრის ჩანაწერი, ასე რომ ისინი ყველაფერი იციან... უნდა მოიფიქროთ ძალიან კარგი მიზეზი თუ რამე გინდათ",
            FAREWELL_MESSAGE: "კარგი, ეს არის მეგობარო",
            INVALID_BUILD_ALERT: "თქვენ იყენებთ არასწორ ბილდს, ძირითად ბილდზე დაბრუნება."
        }
    },
    PAGES: {
        HOME: {
            META_DESCRIPTION: "შეუერთდით PixelsPlace-ს!",
            LOGO_ALT: "ლოგო",
            TIME_TRAVEL: "დროში მგზავრობა",
            SERVERS: "სერვერები",
            START: "დაწყება",
        },
        DISCORD_OAUTH2: {
            LOGGED_IN: "შესული",
            DISCONNECTED: "გათიშული",
            SUCCESS_REDIRECTING: "წარმატებით. გადამისამართება..."
        },
        BUILD_OVERRIDE: {
            LOADING_BUILD: "ბილდის ჩატვირთვა...",
            REMOVING_BUILDS: "ბილდების მოშორება...",
            INVALID_BUILD: "არასწორი ბილდი",
            ERROR_FETCHING_BUILD: "ბილდის მიღების შეცდომა",
            TITLE: "გსურთ მორგებული ბილდის გამოყენება PixelsPlace-ში?",
            SIGNED_BY: "ხელმოწერილი",
            UPDATING_BUILD: "ბილდის განახლება...",
            REMOVE_INSTRUCTION: "თუ გსურთ მოგვიანებით მოშორება, უბრალოდ დააწყვეტეთ თქვენი პროფილის პარამეტრებზე"
        },
        USER_PROFILE: {
            PROFILE_BACKGROUND_ALT: "პროფილის ფონი",
            USER_AVATAR_ALT: "მომხმარებლის ავატარი",
            GUILD_ICON_ALT: "{{guildName}}-ის ხატულა",
            JOIN_GUILD: "შეერთება",
            PIXELS_PLACED: "{{displayName}}-მ განათავსა {{pixelQuantity}} პიქსელი",
            VIEW_PIXELS: "ნახეთ {{displayName}}-ის პიქსელები"
        },
        PARTNERS: {
            SERVERS: "სერვერები",
            PARTICIPATING_SERVERS: "მონაწილე სერვერები",
            SECRET: "საიდუმლო...",
            GUILD_ICON_ALT: "{{guildName}}-ის ხატულა",
            JOIN: "შეერთება"
        },
        TIME_TRAVEL: {
            PAGE_TITLE: "PixelsPlace დროში მგზავრობა",
            PAGE_DESCRIPTION: "შეუერთდით PixelsPlace-ს!",
            API_ERROR: "მთავარ API-სთან დაკავშირებისას მოხდა შეცდომა",
            RELOAD_BUTTON: "განახლება",
            FULL_HISTORY: "სრული ისტორია",
            CHANGES_ONLY: "მხოლოდ ცვლილებები",
            MARCH_LABEL: "მარტი (მ):",
            MULTIPLIER_LABEL: "მამრავლი:"
        },
        PLACE: {
            META_DESCRIPTION: "შეუერთდით PixelsPlace-ს!",
            COPY_LINK: "პიქსელის ლინკის კოპირება",
            LINK_GENERATED: "ლინკი შეიქმნა:",
            LINK_SUCCESSFULLY_COPIED: "ლინკი კოპირებულია!",
            PICK_COLOR: "ფერის არჩევა",
            PICK_A_COLOR: "აირჩიეთ ფერი",
            PREMIUM_ONLY_COLOR: "ეს ფერი მხოლოდ პრემიუმისთვისაა! :(",
            PLACE_PIXEL: "პიქსელის განთავსება",
            LOG_IN_TO_PLACE_PIXEL: "შედით პიქსელის განსათავსებლად",
            PLACE: "განათავსეთ!",
            PREMIUM_ANY_COLOR: "აირჩიეთ ნებისმიერი ფერი",
            WEBSOCKET_KICKED: "WebSocket გათიშულია: გიკიცხეს ოთახიდან",
            ERROR_MAIN_API_CONNECT: "მთავარ API-სთან დაკავშირებისას მოხდა შეცდომა",
            ERROR_FAILED_WEBSOCKET: "WebSocket დაკავშირების შეცდომა",
            WEBSOCKET_SEARCH: "WebSocket-ის ძიება...",
        }
    },
};