module.exports = {
    _LANGUAGE: {
        NAME: "Русский",
        CODE: "ru",
        FLAG: "🇷🇺"
    },
    COMMON: {
        YES: "Да",
        NO: "Нет",
        OK: "Ок",
        CANCEL: "Отмена",
        SUBMIT: "Отправить",
        DELETE: "Удалить",
        EDIT: "Редактировать",
        SAVE: "Сохранить",
        CLOSE: "Закрыть",
        NAME: "Имя",
        AUTHOR: "Автор",
        USE: "Использовать",
        NOT_IMPLEMENTED_YET: "Ещё не реализовано",
        ADMIN: "Админ",
        REDIRECTING: "Перенаправление...",
        LOADING: "Загрузка...",
        NO_PERMISSION: "У вас нет разрешения на это действие",
        NOT_SELECTED: "Не выбрано",
        USER: "Пользователь",
        SERVER: "Сервер",
        HISTORY: "История",
        PREMIUM: "Премиум",
        LOADING: "Загрузка...",
        TRY_AGAIN: "Попробовать снова",
        RELOAD: "Перезагрузить",
        RELOAD_PAGE: "Перезагрузить страницу",
        BACK: "Назад"
    },
    COMPONENTS: {
        BUILD_SWITCHER: {
            ERROR_FETCH_BUILDS: "Ошибка получения сборок",
            UNKNOWN_ERROR: "Неизвестная ошибка",
            INVALID_BUILD_MESSAGE: "Вы используете недействительную сборку. Возврат к основной сборке...",
            BUILD_NOT_FOUND: "Сборка не найдена",
            ERROR_SWITCH_BUILD: "Ошибка переключения сборки",
            ERROR_FETCH_BRANCH: "Ошибка получения текущей ветки",
            BUILD_OVERRIDE: "Переопределение сборки",
            CUSTOM_BRANCH_WARNING: "Вы редактируете пользовательскую ветку",
            ACTIVE_BUILD: "Активная сборка",
            ACTIVE_BRANCH: "Активная ветка",
            SWITCHING_BUILD: "Переключение сборки..."
        },
        HEADER: {
            ADVANTAGES: "Преимущества",
            PROFILE: "Профиль",
            DISCONNECT: "Отключиться",
            REMOVE_BUILD_OVERRIDE: "Удалить переопределение сборки",
            LOGIN: "Войти",
            LOGGED_OUT: "Вышел из системы",
            VIEW_AS_USER: "Просмотр как пользователь",
            NORMAL_VIEW: "Обычный просмотр"
        },
        PREMIUM_POPUP: {
            TITLE: "Вам нужен Премиум!",
            DESCRIPTION1: "Представьте, что вы можете выбрать любой цвет во ВСЕЛЕННОЙ для рисования... Вы можете!",
            DESCRIPTION2: "Получите это и многое другое с PixelsPlace Премиум",
            MAYBE_LATER: "Может быть позже",
            DISCOVER_PREMIUM: "Узнать о Премиум!"
        },
        PREMIUM_WARNING: {
            FEATURE_PREMIUM_ONLY: "Эта функция только для Премиум",
            BUY_PREMIUM_HERE: "Купить Премиум здесь!"
        }
    },
    LAYOUTS: {
        MAIN_LAYOUT: {
            BANNED_TITLE: "Вы были забанены.",
            AFFECTED_AREAS: "Затронутые области",
            NO_FANCY_UNBAN_PAGE: "Красивой страницы для формы разбана не будет, в основном это всё что есть сейчас",
            OPEN_TICKET_INSTRUCTION: "Единственное, что вы можете сделать, это открыть тикет в",
            EXPLAIN_WHAT_HAPPENED: "и попытаться объяснить, что произошло",
            MODS_HAVE_RECORDS: "Но знайте, что у модераторов есть записи всего, поэтому они в основном всезнающие... Вам придётся придумать действительно очень хорошее оправдание, если вы хотите чего-то",
            FAREWELL_MESSAGE: "Ну, вот и всё, друг, удачи",
            INVALID_BUILD_ALERT: "Вы используете недействительную сборку, возврат к основной сборке."
        }
    },
    PAGES: {
        HOME: {
            META_DESCRIPTION: "Присоединяйтесь к PixelsPlace!",
            LOGO_ALT: "логотип",
            TIME_TRAVEL: "Путешествие во времени",
            SERVERS: "Серверы",
            START: "Начать",
        },
        DISCORD_OAUTH2: {
            LOGGED_IN: "Вошёл в систему",
            DISCONNECTED: "Отключён",
            SUCCESS_REDIRECTING: "успешно. Перенаправление..."
        },
        BUILD_OVERRIDE: {
            LOADING_BUILD: "Загрузка сборки...",
            REMOVING_BUILDS: "Удаление сборок...",
            INVALID_BUILD: "Недействительная сборка",
            ERROR_FETCHING_BUILD: "Ошибка получения сборки",
            TITLE: "Хотите использовать пользовательскую сборку в PixelsPlace?",
            SIGNED_BY: "Подписано",
            UPDATING_BUILD: "Обновление сборки...",
            REMOVE_INSTRUCTION: "Если вы хотите удалить позже, просто нажмите на настройки вашего профиля"
        },
        USER_PROFILE: {
            PROFILE_BACKGROUND_ALT: "фон профиля",
            USER_AVATAR_ALT: "Аватар пользователя",
            GUILD_ICON_ALT: "Иконка {{guildName}}",
            JOIN_GUILD: "Присоединиться",
            PIXELS_PLACED: "{{displayName}} разместил {{pixelQuantity}} пикселей",
            VIEW_PIXELS: "Посмотреть пиксели {{displayName}}"
        },
        PARTNERS: {
            SERVERS: "СЕРВЕРЫ",
            PARTICIPATING_SERVERS: "Участвующие серверы",
            SECRET: "Секрет...",
            GUILD_ICON_ALT: "Иконка {{guildName}}",
            JOIN: "Присоединиться"
        },
        TIME_TRAVEL: {
            PAGE_TITLE: "Путешествие во времени PixelsPlace",
            PAGE_DESCRIPTION: "Присоединяйтесь к PixelsPlace!",
            API_ERROR: "Произошла ошибка при подключении к основному API",
            RELOAD_BUTTON: "Перезагрузить",
            FULL_HISTORY: "Вся история",
            CHANGES_ONLY: "Только изменения",
            MARCH_LABEL: "Март (м):",
            MULTIPLIER_LABEL: "Множитель:"
        },
        PLACE: {
            META_DESCRIPTION: "Присоединяйтесь к PixelsPlace!",
            COPY_LINK: "Скопировать ссылку на пиксель",
            LINK_GENERATED: "Ссылка создана:",
            LINK_SUCCESSFULLY_COPIED: "Ссылка скопирована в буфер обмена!",
            PICK_COLOR: "Выбрать цвет",
            PICK_A_COLOR: "Выберите цвет",
            PREMIUM_ONLY_COLOR: "Этот цвет доступен только для Премиум! :(",
            PLACE_PIXEL: "Разместить пиксель",
            LOG_IN_TO_PLACE_PIXEL: "Войдите, чтобы разместить пиксель",
            PLACE: "Разместить!",
            PREMIUM_ANY_COLOR: "Выберите любой цвет с",
            WEBSOCKET_KICKED: "WebSocket отключён: Вас кикнули из комнаты",
            ERROR_MAIN_API_CONNECT: "Произошла ошибка при подключении к основному API",
            ERROR_FAILED_WEBSOCKET: "Сбой подключения WebSocket",
            WEBSOCKET_SEARCH: "Поиск WebSocket...",
        }
    },
}